OpenXava quiere dar gracias a:
<ul>













  <li><b>Gesti&oacute;n cuatrocientos</b>: por confiar en &eacute;l y
usarlo como su marco de trabajo para desarrollar sus aplicaciones. </li>













  <li><b>Juan Vicente Llavador</b>: por su apoyo incondicional para que
Xava sea Open desde Gesti&oacute;n 400. </li>













  <li><b>M&ordf; Carmen Gimeno Alabau</b>: por el excelente gestor de
persistencia basado en Hibernate que ha construido para OpenXava; y por
el
proyecto demo ProductSale. </li>













  <li><b><a href="http://www.newitech.com/">Newitech Sp. z o.o.</a>
(Radoslaw Ostrzycki, Lukasz Milobedzki)</b>:
por configurar Jakarta Commons Loggin como sistema de <i>logging</i>,
a&ntilde;adir el atributo 'escala' en las propiedades,
generaci&oacute;n de portlets con UTF-8, mejorar la generaci&oacute;n
del mapeo hibernate,
traducci&oacute;n al polaco y m&aacute;s. </li>













  <li><span style="font-weight: bold;">Jos&eacute; Puente Ferrandis</span>: por el plugin de Eclipse (Navigator) con asistentes para crear proyectos OX y editores Eclipse para archivos OX.</li>

  <li><b>Sergio Mondino: </b> por el plugin de Eclipse (Importer) para crear
componentes OX desde las tablas de la base de datos. </li>













  <li><b>Jos&eacute; Luis Santiago</b>: por la versi&oacute;n para
Liferay Portal y por las dem&aacute;s aportaciones valiosas que ha
hecho al c&oacute;digo. </li>













  <li><b>Jos&eacute; Enrique Romero Flores</b>: por el estereotipo
HTML_TEXT/TEXTO_HTML y la integraci&oacute;n con el portal Stringbeans.</li>













  <li><span style="font-weight: bold;">Christoph Ruckert</span>:
por el
atributo en-cada-peticion para las&nbsp;acciones en
controlladores.xml,&nbsp;el estereotipo ETIQUETA_IMAGEN y
buttonsForNoImageActions para xava.properties.</li>












  <li><span style="font-weight: bold;">Trifon Trifonov</span>: por <span style="font-style: italic;">final statics</span>para
propiedades en las interfaces en la generaci&oacute;n de
c&oacute;digo, el atributo longitud-visual en vista-propiedad,
el&nbsp;soporte de b&uacute;lgaro en la generaci&oacute;n de portlets y
mostrar las etiquetas de las propiedades al a&ntilde;adir columnas a la lista.</li>









  <li><span style="font-weight: bold;">Janesh Kodikara:</span>
por los estereotipos EMAIL, TELEFONO,&nbsp;WEBURL,&nbsp;IP, ISBN,
TARJETA_CREDITO,&nbsp; LISTA_EMAIL,&nbsp;el calculador
DaysDelayCalculator, el conversor StringTimeConverter y la utilidad Emails.</li>




  <li><span style="font-weight: bold;">Sami AlSayyed</span>: por a&ntilde;adir protecci&oacute;n contra XSS.</li>













  <li><b>Hans-Joerg Bauer</b>: por corregir errores en el c&oacute;digo
y la revisi&oacute;n gramatical de la gu&iacute;a de referencia en
ingl&eacute;s.</li>













  <li><span style="font-weight: bold;">Bernab&eacute; Torres Ayala</span>:
por el editor radioButton para valores-posibles.</li>













  
  <li><span style="font-weight: bold;">Eduardo Escrihuela</span>: por
el calculador CurrentTimestampCalculator, la documentaci&oacute;n sobre la configuraci&oacute;n de PostgreSQL
para OpenXava y gu&iacute;a para Mi Primer Proyecto OpenXava.</li>






  <li><span style="font-weight: bold;">Mat&iacute;as Gagliano</span>: V&iacute;nculo para mostrar/ocultar la parte del filtro en la lista y las colecciones.</li>













  <li><b>Ana Andres, Ivan Mart&iacute;n, Daniel Gimeno, Isabel Valero,
Javier Paniza, Luis Miguel Hern&aacute;ndez, Miguel Angel Embuena, Lars
Lathan</b>: por las fant&aacute;sticas aplicaciones J2EE que han hecho
con OpenXava, y que han hecho que OpenXava algo &uacute;til. </li>













  <li><b>Ana Andr&eacute;s, Ivan Mart&iacute;n, Daniel Gimeno, Luis
Miguel Hern&aacute;ndez, Miguel Angel Embuena, Lars Lathan</b>: por el
c&oacute;digo e ideas que han aportado a OpenXava. </li>













  <li><b>Lars Lathan</b>: por la traducci&oacute;n a alem&aacute;n. </li>













  <li><b>Utamayasa</b>: por la traducci&oacute;n a indonesio. </li>













  <li><b>Javier Paniza</b>: por programar. </li>













  <li><b>Ana Andr&eacute;s</b>: por los dibujos de este sitio. </li>













  <li><b>Carlos Gasc&oacute;, Carlos D&iacute;az</b>: por su ayuda en
las traducciones a Ingl&eacute;s. </li>













</ul>
