<br>
<ul>
  <li><a href="#Por_que_es_mejor_OpenXava_que_IBM">&iquest;Por
qu&eacute; es mejor OpenXava que IBM WebSphere Studio o Rational
Application Developer?</a></li>
  <li><a href="#%BFPor_qu%E9_es_mejor_xava_que_una_soluci%F3n">&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</a><br>
  </li>
  <li><a href="#%BFQue_diferencias_hay_entre_xava_y">&iquest;Que
diferencias
hay entre OpenXava y XDoclet?</a></li>
  <li><a href="#%BFPor_qu%E9_xava_no_usa_Struts">&iquest;Por
qu&eacute; OpenXava no usa Struts?</a></li>
  <li><a href="#%BFCon_qu%E9_sistema_de_gesti%F3n_de_usuarios">&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</a><br>
  </li>
  <li><a href="#%BFQu%E9_servidores_de_aplicaciones_est%E1n">&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</a></li>
  <li><a href="#%BFQu%E9_herramientas_de_desarrollo_se">&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</a></li>
  <li><a href="#%BFCon_que_navegadores_de_internet">&iquest;Con
qu&eacute;
navegadores de internet funciona?</a></li>
  <li><a href="#%BFQu%E9_JDK_necesita_para_funcionar">&iquest;Qu&eacute;
JDK necesita para funcionar?</a></li>
  <li><a href="#%BFPodemos_generar_con_xava_una">&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</a></li>
  <li><a href="#%BFQu%E9_tipo_de_licencia_tiene_openxava">&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</a><br>
  </li>
</ul>
<h4><a name="Por_que_es_mejor_OpenXava_que_IBM"></a>&iquest;Por
qu&eacute; es mejor OpenXava que IBM WebSphere Studio o Rational
Application Developer?</h4>
Es cierto que estas herramientas de IBM son sofisticadas y pueden
suponer una buena ayuda en muchas circunstancias, pero OpenXava se
presenta como una alternativa, especialmente cuando se quiere
desarrollar aplicaciones de Gesti&oacute;n.<br>
Algunas de las ventajas de OpenXava sobre WebSphere Studio y Rational
Application Developer son:<br>
<ul>
  <li>OpenXava permite desarrollar m&aacute;s r&aacute;pidamente y de
forma m&aacute;s sencilla. Prueba hacer el ejemplo que viene con el
tutorial de OpenXava, con el mismo nivel de funcionalidad, y usando la
misma tecnolog&iacute;a (J2EE incluyendo EJB CMP) con WebSphere Studio
y ver&aacute;s.</li>
  <li>OpenXava es un generador activo de c&oacute;digo mientras que
WebSphere Studio es un generador pasivo de c&oacute;digo.</li>
  <li>El coste de licencia por desarrollador de OpenXava es de 0 euros,
mientras que el de WebSphere Studio...</li>
  <li>OpenXava genera aplicaciones para JBoss y WebSphere
(f&aacute;cilmente extensible a otros), WebSphere Studio genera
aplicaciones solo para WebSphere Application Server.</li>
</ul>
<h4><a name="&iquest;Por_qu&eacute;_es_mejor_xava_que_una_soluci&oacute;n"></a>&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</h4>
Yo no dir&iacute;a que es mejor, simplemente es diferente. Con MDA
generamos una aplicaci&oacute;n a partir de unos modelos UML y
as&iacute; reducimos los costes de desarrollo. Con OpenXava hacemos
lo
mismo, pero en lugar de hacer la definici&oacute;n con UML la
hacemos con XML.<br>
Y as&iacute; tenemos un conjunto de suculentas ventajas respecto a
MDA:<br>
<ul>
  <li>XML es texto, por lo tanto:</li>
  <ul>
    <li>No necesitamos
herramientas sofisticadas, un simple editor sirve.<br>
    </li>
    <li>Mucha gente prefiere el
texto a los gr&aacute;ficos. Porque es verdad 'que una imagen vale
m&aacute;s que mil palabras', pero tambi&eacute;n es verdad que
para la humanidad la palabra (texto) ha sido un medio muy eficaz de
transmitir informaci&oacute;n durante siglos (al final el
Lat&iacute;n se impuso a la escritura jerogl&iacute;fica
egipcia)</li>
  </ul>
  <li>XML es por naturaleza
extensible, as&iacute; a&ntilde;adir nuevas caracteristicas a
OpenXava es muy f&aacute;cil.</li>
  <li>XML esta muy extendido y
cuenta con gran cantidad de validadores y editores especiales.</li>
  <li>XML es un
est&aacute;ndar conocido.</li>
  <li>XML es muy f&aacute;cil.</li>
</ul>
OpenXava y MDA no son cosas excluyentes, de hecho se puede crear una
herramienta MDA encima de OpenXava; solo habr&iacute;a que generar
los
archivos XML de OpenXava a partir del modelo UML.<br>
<h4><a name="&iquest;Que_diferencias_hay_entre_xava_y"></a>&iquest;Que
diferencias
hay entre OpenXava y XDoclet?</h4>
XDoclet consigue que lo que antes se hac&iacute;a con varias clases
de
Java y varios complicados archivos XML ahora se puede hacer con una
sola clase de Java. <br>
OpenXava consigue que lo que antes se hac&iacute;a con varias
clases de
Java y varios complicados archivos XML ahora se puede hacer con un solo
y simple archivo XML.<br>
XDoclet y OpenXava son parecidos, solo que en XDoclet la base para
definir
nuestras aplicaciones es el c&oacute;digo Java y en OpenXava es el
XML.<br>
XML parece m&aacute;s natural para definir que Java y sus
anotaciones
porque:<br>
<ul>
  <li>Permite estructuras
jerarquicas.</li>
  <li>Validaci&oacute;n y
autocompletado autom&aacute;tico gracias a
los editores XML.</li>
  <li>M&aacute;s
f&aacute;cil de aprender por un programador no Java.</li>
</ul>
Otra diferencia entre XDoclet y OpenXava es que OpenXava genera no solo
el
c&oacute;digo EJB, sino una aplicaci&oacute;n entera, con la
capa del
controlador y de la interfaz gr&aacute;fica, y ya lista para usar.<br>
XDoclet y OpenXava no son exclusivos, de hecho OpenXava utiliza XDoclet
para
generar el c&oacute;digo EJB, y adem&aacute;s podemos escribir
beans de
EJB con XDoclet e integrarlos en una aplicaci&oacute;n OpenXava si
queremos.<br>
<h4><a name="&iquest;Por_qu&eacute;_xava_no_usa_Struts"></a>&iquest;Por
qu&eacute; OpenXava no usa Struts?</h4>
Struts permite definir la parte de controlador de una
aplicaci&oacute;n
web, y OpenXava ya tiene su propio marco de controlador. Struts
est&aacute; orientado a la navegaci&oacute;n entre
p&aacute;ginas,
mientras que en las aplicaciones t&iacute;picas de
gesti&oacute;n suele
haber muchos casos en los que permanecemos en una misma
p&aacute;gina
en la que
el usuario puede hacer una cantidad grande de acciones; para esto
Struts es un
poco engorroso, y la capa de controlador de OpenXava acopla mejor.<br>
Otra ventaja es que la capa de controlador de OpenXava no depende de la
tecnolog&iacute;a web, y as&iacute; podr&iacute;amos tener,
por
ejemplo, una aplicaci&oacute;n OpenXava con otra
tecnolog&iacute;a de
presentaci&oacute;n (de hecho existe una versi&oacute;n de
OpenXava para
hacer aplicaciones Swing).<br>
Programadores con experiencia en Struts han mostrado alivio al
trabajar con OpenXava para hacer aplicaciones de gesti&oacute;n.<br>
<h4><a name="&iquest;Con_qu&eacute;_sistema_de_gesti&oacute;n_de_usuarios"></a>&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</h4>
Las primeras versiones de OpenXava (en swing) ten&iacute;an
incluido un
sistema de seguridad y navegaci&oacute;n. La versi&oacute;n
actual no
lo hace, en su lugar genera los m&oacute;dulos web que el
desarrollador
puede incrustar en el marco de seguridad y navegaci&oacute;n que
desee.<br>
Una opci&oacute;n buena es usar los modulos OpenXava como portlets
e
integrarlos con un portal (como JetSpeed o Websphere Portal).
As&iacute; es como la
mayor&iacute;a de aplicaciones actuales OpenXava se instalan en los
clientes.<br>
<h4><a name="&iquest;Qu&eacute;_servidores_de_aplicaciones_est&aacute;n"></a>&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</h4>
OpenXava soporta:<br>
<ul>
  <li>JBoss 3.2.x y 4.0.x</li>
  <li>WebSphere 5.0, 5.1 y 6.0</li>
</ul>
Usando EJB CMP2 nativo para persistencia.<br>
Adaptarlo para que funcione con otros servidores J2EE es harto sencillo.<br>
<h4><a name="&iquest;Qu&eacute;_herramientas_de_desarrollo_se"></a>&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</h4>
El archivo de descarga de OpenXava viene con un workspace para Eclipse
3
configurado. Pero OpenXava no usa recursos de Eclipse sino que
est&aacute;
basado en la herramienta de c&oacute;digo abierto 'Ant', por lo que
sin
ning&uacute;n problema se puede usar con cualquier otro IDE, e
incluso
desde l&iacute;nea de &oacute;rdenes.<br>
<h4><a name="&iquest;Con_que_navegadores_de_internet"></a>&iquest;Con
qu&eacute;
navegadores de internet funciona?</h4>
Internet Explorer, Mozilla y Firefox. El nivel de JavaScript que usa es
bajo, y la disposici&oacute;n no se hace con CSS, as&iacute;
que
funciona bien con un abanico grande de navegadores.<br>
<h4><a name="&iquest;Qu&eacute;_JDK_necesita_para_funcionar"></a>&iquest;Qu&eacute;
JDK necesita para funcionar?</h4>
OpenXava funciona con JDK1.3.1, JDK1.4.2 y JDK1.5.0<br>
<h4><a name="&iquest;Podemos_generar_con_xava_una"></a>&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</h4>
No ser&iacute;a dif&iacute;cil de adaptar, porque el nucleo de
OpenXava es
el XML, y no est&aacute; vinculado muy fuertemente a EJB o
Servlets.
As&iacute; que hacer un generador que hiciera aplicaciones para
PDAs, o
aplicaciones de 2 capas (usando swing por ejemplo) es sencillo. De
hecho la versi&oacute;n inicial de OpenXava funcionaba con Swing +
EJB, la
actual funciona con JSP + EJB, y posiblemente la versi&oacute;n 2
funcione con JSP + Hibernate. Y todo esto sin cambiar las aplicaciones
OpenXava que siempre tienen la misma estructura.<br>
Con un poco de ingenio se podr&iacute;a hacer incluso una
versi&oacute;n .NET.<br>
<h4><a name="&iquest;Qu&eacute;_tipo_de_licencia_tiene_openxava"></a>&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</h4>
LGPL. Se puede usar OpenXava para desarrollar proyectos comerciales de
cualquier tipo. Lo &uacute;nico es que no se puede hacer una
versi&oacute;n comercial del propio OpenXava.<br>
