<h2>Para migrar de OpenXava 2.0 a OpenXava 2.0.1</h2>
No hay consideraciones

<h2>Para migrar de OpenXava 1.2.1 a OpenXava 2.0</h2>

<h4>Establece valor para referenc&iacute;as (en combos) con clave m&uacute;ltiple en las pruebas JUnit</h4>
Hasta ahora, para establecer valor a una referenc&iacute;a visualizada como 
<code>lista-descripciones</code> (como combo), y mapeada a la base de datos usando
varias columnas, escribiamos:
<pre>
PermisoConduccionKey clave = new PermisoConduccionKey();
clave.setType("C ");
clave.setLevel(1);
setValue("drivingLicence.KEY", clave.toString());		
</pre>
Pero, si usamos solo POJOs, sin clases 'Key', hemos de escribir:
<pre>
PermisoConduccion clave = new PermisoConduccion();
clave.setType("C ");
clave.setLevel(1);
setValue("drivingLicence.KEY", clave.toString());		
</pre>
Es mejor usar la &uacute;ltima forma, porque funciona con POJOs y EJBs.

<h4>Hibernate: Referencias con columnas no nula como clave for&aacute;nea</h4>

En la versi&oacute;n EJB si tenemos una referencia a otra entidad cuya clave est&aacute;
compuesta por tipos primitivos, el c&oacute;digo se genera de tal forma que no
se graban nulos en la base de datos, aunque asignemos un nulo a la referencia.<br>
En la versi&oacute;n Hibernate si asignamos nulo a una referencia, se graban valores
nulos en la base de datos.<br>
Por supuesto, el comportamiento de la versi&oacute;n Hibernate es m&aacute;s correcto, pero
podemos hacer que en Hibernate se eviten los nulos en la base de dato, simplemente
usando conversores en el mapeo de referencia (ver secci&oacute;n 6.3 de la gu&iacute;a de referencia).<br>
Es decir, quiz&aacute;s necesitemos a&ntilde;adir algunos conversores a nuestra referencias para
migrar nuestras aplicaciones de EJB2 a Hibernate.<br>


<h4>Cambiar la secci&oacute;n activa</h4>

<code>xava_activeSection</code> ya no se usa para cambiar la secci&oacute;n activa.
Ahora si queremos cambiar la secci&oacute;n activa tenemos que llamar al m&eacute;todo
<code>setActiveSection</code> de la vista deseada (<code>org.openxava.view.View</code>).

<h4>IAggragetOidCalculator</h4>
El m&eacute;todo <code>setContainerKey</code> se ha renombrado a <code>setContainer</code>.
Y su sem&aacute;ntica tambi&eacute;n. Ahora se recibe el objeto contenedor en vez
de la clave. De esta manera este calculador es consistente en la versi&oacute;n EJB2
y POJO (si clases para clave).

<h2>Para migrar de OpenXava 1.2 a OpenXava 1.2.1</h2>

<h4>Generaci&oacute;n Hibernate</h4>
Ahora cuando la generaci&oacute;n EJB se hace, la generaci&oacute;n de
c&oacute;digo hibernate se realiza tambi&eacute;n (aunque la versi&oacute;n hibernate
todav&iacute;a no se soporta al 100%).<br>
Aunque uses solo la versi&oacute;n EJB necesitas hacer una peque&ntilde;a adaptaci&oacute;n
en tu proyecto:
<ul>
<li> Crea la carpeta <code>hibernate</code> en tu proyecto.
<li> Crea el archivo <code>hibernate.cfg.xml</code> dentro de la carpeta <code>hibernate</code>.
</ul>
El <code>hibernate.cfg.xml</code> ha de ser:
<pre>
&lt;!DOCTYPE hibernate-configuration PUBLIC
   "-//Hibernate/Hibernate Configuration DTD//EN"
   "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"&gt;
  &lt;hibernate-configuration&gt;
   &lt;session-factory&gt;
       &lt;property name="hibernate.connection.datasource"&gt;@datasource.prefix@/@datasource@&lt;/property&gt;
       &lt;property name="hibernate.dialect"&gt;@hibernate.dialect@&lt;/property&gt;
       &lt;property name="hibernate.show_sql"&gt;false&lt;/property&gt;
   &lt;/session-factory&gt;
&lt;/hibernate-configuration&gt;
</pre>
Adicionalmente tienes que incluir la propiedad <code>hibernate.dialect</code> en tus
archivos de configuraci&oacute;n:
<pre>
hibernate.dialect=org.hibernate.dialect.HSQLDialect
</pre>

<h4>Sintaxis XML de OpenXava</h4>
<ul>
<li> En espa&ntilde;ol PEQUE&Ntilde;A pasa a ser PEQUENA. Para evitar problemas con
ISO-8859-1 y UTF-8.
</ul>


<h2>Para migrar de OpenXava 1.1 a OpenXava 1.2</h2>

<h4>C&oacute;digo generado</h4>
Ahora las interfaces remote de EJB tienen el sufijo <i>Remote</i>, y la
interfaz de negocio generada para cada componente (por ejemplo <code>ICliente</code>)
no contiene todos los m&eacute;todos de la interface remota.<br>
Esto es para permitir que la futura versi&oacute;n 2 de OpenXava pueda trabajar
con EJB e Hibernate en el mismo projecto y a la vez.<br>
Para adaptar el c&oacute;digo hay que:
<ul>
<li>Borrar todo el c&oacute;digo generado
<li>Regenerar el c&oacute;digo EJB
<li>Compilar
<li>Buscar y corregir los errores de sintaxis
</ul>
Para corregir los errores de sintaxis se tiene que hacer cambios como &eacute;ste:
<pre>
<b>Cliente</b> cliente = ClienteUtil.getHome().findByNombre("PEPE");
String nombre = cliente.getNombre();
</pre>
Cambiarlo por:
<pre>
<b>ICliente</b> cliente = ClienteUtil.getHome().findByNombre("PEPE");
String nombre = cliente.getNombre();
</pre>
Si se usan m&eacute;todos espec&iacute;ficos de EJB hay que moldear a la interfaz remota:
<pre>
<b>Cliente</b> cliente = ClienteUtil.getHome().findByNombre("PEPE");
ClienteKey key = cliente.getPrimaryKey();
</pre>
Cambiarlo por:
<pre>
<b>ClienteRemote</b> cliente = ClienteUtil.getHome().findByNombre("PEPE");
ClienteKey key = cliente.getPrimaryKey();
</pre>
Es decir, cambiar <code>Cliente</code> por <code>ICliente</code> cuando sea posible,
de no serlo cambiarlo por <code>CustomeRemote</code>.
</p>

<h4>Pruebas JUnit</h4>
<ul>
<li> Al borrar un objeto en a mantenimiento ahora OpenXava muestra una ventana javascript
	para confirmar, en vez de cambiar a otro controlador. Por lo tanto en tus pruebas
	para borrar un objeto en un m&oacute;dulo de mantenimiento solo necesitas usar execute("CRUD.delete"). 
	En este caso 'S&iacute;' como respuesta de confirmaci&oacute;n.
</ul>


<h4>Otros</h4>
<ul>
<li> Cambia el nombre packages-ejb.properties en gen-src-xava a packages.properties
		(o simplemente borrar packages-ejb.properties y regenera c&oacute;digo).
</li>
</ul>

<h2>Para migrar de OpenXava 1.0 a OpenXava 1.1</h2>

<h4>APIs</h4>
<ul>
<li>MetaView.getMetaViewCollection pasa a llamarse MetaView.getMetaCollectionView
<li>MetaView.getMetaViewReference pasa a llamarse MetaView.getMetaReferenceView
</ul>

<h4>Pruebas junit</h4>
<ul>
<li> Se cambia el mensaje 'Objeto borrado satisfactoriamente' por 
	'{0} borrado satisfactoriamente'. As&iacute; es necesario cambiar los asserts
	de este mensaje.
</ul>