OpenXava quiere dar gracias a:
<ul>
  <li><b>Gesti&oacute;n cuatrocientos</b>: por confiar en &eacute;l y
usarlo como su marco de trabajo para desarrollar sus aplicaciones. </li>
  <li><b>Juan Vicente Llavador</b>: por su apoyo incondicional para que
Xava sea Open desde Gesti&oacute;n 400. </li>
  <li><b>M&ordf; Carmen Gimeno Alabau</b>: por el excelente gestor de
persistencia basado en Hibernate que ha construido para OpenXava. </li>
  <li><b><a href="http://www.newitech.com/">Hewitech Sp. z o.o.</a> (Radoslaw Ostrzycki, Lukasz Milobedzki)</b>:
por configurar Jakarta Commons Loggin como sistema de <i>logging</i>, a&ntilde;adir el atributo 'escala' en las propiedades 
y generaci&oacute;n de portlets con UTF-8. </li>
  <li><b>Sergio Mondino: </b> por el plugin de Eclipse para crear componentes OX 
desde las tablas de la base de datos. </li>
  <li><b>Jos&eacute; Luis Santiago</b>: por la versi&oacute;n para
Liferay Portal y por las dem&aacute;s aportaciones valiosas que ha
hecho al c&oacute;digo. </li>
  <li><b>Jos&eacute; Enrique Romero Flores</b>: por el estereotipo HTML_TEXT/TEXTO_HTML.
  <li><b>Ana Andres, Ivan Mart&iacute;n, Daniel Gimeno, Isabel Valero,
Javier Paniza, Luis Miguel Hern&aacute;ndez, Miguel Angel Embuena, Lars
Lathan</b>: por las fant&aacute;sticas aplicaciones J2EE que han hecho
con OpenXava, y que han hecho que OpenXava algo &uacute;til. </li>
  <li><b>Ana Andr&eacute;s, Ivan Mart&iacute;n, Daniel Gimeno, Luis
Miguel Hern&aacute;ndez, Miguel Angel Embuena, Lars Lathan</b>: por el
c&oacute;digo e ideas que han aportado a OpenXava. </li>
  <li><b>Hans-Joerg Bauer</b>: por la revisi&oacute;n gramatical de la gu&iacute;a 
  			de referencia en ingl&eacute;s. </li>
  <li><b>Lars Lathan</b>: por la traducci&oacute;n a alem&aacute;n. </li>
  <li><b>Utamayasa</b>: por la traducci&oacute;n a indonesio. </li>
  <li><b>Javier Paniza</b>: por programar. </li>
  <li><b>Ana Andr&eacute;s</b>: por los dibujos de este sitio. </li>
  <li><b>Carlos Gasc&oacute;, Carlos D&iacute;az</b>: por su ayuda en
las traducciones a Ingl&eacute;s.
  </li>
</ul>
