<br>
<ul>
  <li><a href="portal/faq.psml#Why_to_use_OpenXava_if_we_have_Spring">&iquest;Por
qu&eacute; usar OpenXava si tenemos Spring, Hibernate, JSF, EJB3 y
as&iacute; por el estilo?</a></li>
  <li><a href="portal/faq.psml#Por_que_es_mejor_OpenXava_que_IBM">&iquest;Por
qu&eacute; es mejor OpenXava que IBM WebSphere Studio o Rational
Application Developer?</a></li>
  <li><a href="portal/faq.psml#Por_que_es_mejor_xava_que_una_solucion">&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</a><br>
  </li>
  <li><a href="portal/SeamBooking">&iquest;Por qu&eacute; OpenXava es
mejor que el marco de trabajo Seam de JBoss?</a> </li>
  <li><a href="portal/faq.psml#Que_diferencias_hay_entre_xava_y">&iquest;Que
diferencias
hay entre OpenXava y XDoclet?</a></li>
  <li><a href="portal/faq.psml#Por_que_xava_no_usa_Struts">&iquest;Por
qu&eacute; OpenXava no usa Struts?</a></li>
  <li><a href="portal/faq.psml#Its_only_XML_no_Java_class">&iquest;Es
solo XML, no hay
clases Java?</a></li>
  <li><a href="portal/faq.psml#How_scalable_it_is">&iquest;Cu&aacute;n
escalable es
OpenXava?</a></li>
  <li><a href="portal/faq.psml#Con_que_sistema_de_gestion_de_usuarios">&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</a><br>
  </li>
  <li><a href="portal/faq.psml#Que_servidores_de_aplicaciones_estan">&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</a></li>
  <li><a href="portal/faq.psml#What_Java_Portals_are_supported">&iquest;Qu&eacute;
portales Java est&aacute;n soportados?</a></li>
  <li><a href="portal/faq.psml#Que_herramientas_de_desarrollo_se">&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</a></li>
  <li><a href="portal/faq.psml#Con_que_navegadores_de_internet">&iquest;Con
qu&eacute;
navegadores de internet funciona?</a></li>
  <li><a href="portal/faq.psml#Que_JDK_necesita_para_funcionar">&iquest;Qu&eacute;
JDK necesita para funcionar?</a></li>
  <li><a href="portal/faq.psml#Podemos_generar_con_xava_una">&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</a></li>
  <li><a href="portal/faq.psml#Que_tipo_de_licencia_tiene_openxava">&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</a><br>
  </li>
</ul>
<h4><a name="Why_to_use_OpenXava_if_we_have_Spring"></a>&iquest;Por
qu&eacute; usar OpenXava si tenemos Spring, Hibernate, JSF, EJB3 y
as&iacute; por el estilo?</h4>
Hoy d&iacute;a vivimos buenos tiempos. Es cierto que Spring, Hibernate,
JSF y EJB3 son mucho mejor que J2EE 1.4. Todos esto marcos de trabajo y
tecnolog&iacute;as son buenas (de hecho OpenXava usa algunas de ellas),
pero si necesitas desarrollar
aplicaciones de gesti&oacute;n la cantidad de c&oacute;digo a escribir
sigue siendo grande, y la productividad es baja comparada con otras
tecnolog&iacute;as (Visual Basic, 4GL, Delphi, RPG, etc).<br>
OpenXava simplemente tiene un nivel de abstracci&oacute;n superior para
obtener as&iacute; una forma simple y f&aacute;cil de desarrollar
aplicaciones de gesti&oacute;n con J2EE y con estilo Orientado a
Objetos.<br>
Si no me crees. Pruebalo. Mira las aplicaciones de demo, por
ejemplo&nbsp;<span style="font-style: italic;">JBoss Seam Booking Demo</span>
desarrollada con OpenXava, mira su c&oacute;digo e intenta
desarrollarla con tu marco de trabajo favorito, y comparalo por ti
mismo.<br>
<h4><a name="Por_que_es_mejor_OpenXava_que_IBM"></a>&iquest;Por
qu&eacute; es mejor OpenXava que IBM WebSphere Studio o Rational
Application Developer?</h4>
Es cierto que estas herramientas de IBM son sofisticadas y pueden
suponer una buena ayuda en muchas circunstancias, pero OpenXava se
presenta como una alternativa, especialmente cuando se quiere
desarrollar aplicaciones de Gesti&oacute;n.<br>
Algunas de las ventajas de OpenXava sobre WebSphere Studio y Rational
Application Developer son:<br>
<ul>
  <li>OpenXava permite desarrollar m&aacute;s r&aacute;pidamente y de
forma m&aacute;s sencilla. Prueba hacer el ejemplo que viene con el
tutorial de OpenXava, con el mismo nivel de funcionalidad, y usando la
misma tecnolog&iacute;a (J2EE incluyendo EJB CMP) con WebSphere Studio
y ver&aacute;s.</li>
  <li>OpenXava es un generador activo de c&oacute;digo mientras que
WebSphere Studio es un generador pasivo de c&oacute;digo.</li>
  <li>El coste de licencia por desarrollador de OpenXava es de 0 euros,
mientras que el de WebSphere Studio...</li>
  <li>OpenXava genera aplicaciones para JBoss y WebSphere
(f&aacute;cilmente extensible a otros), WebSphere Studio genera
aplicaciones solo para WebSphere Application Server.</li>
</ul>
<h4><a name="Por_que_es_mejor_xava_que_una_solucion"></a>&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</h4>
Yo no dir&iacute;a que es mejor, simplemente es diferente. Con MDA
generamos una aplicaci&oacute;n a partir de unos modelos UML y
as&iacute; reducimos los costes de desarrollo. Con OpenXava hacemos
lo
mismo, pero en lugar de hacer la definici&oacute;n con UML la
hacemos con XML.<br>
Y as&iacute; tenemos un conjunto de suculentas ventajas respecto a
MDA:<br>
<ul>
  <li>XML es texto, por lo tanto:</li>
  <ul>
    <li>No necesitamos
herramientas sofisticadas, un simple editor sirve.<br>
    </li>
    <li>Mucha gente prefiere el
texto a los gr&aacute;ficos. Porque es verdad 'que una imagen vale
m&aacute;s que mil palabras', pero tambi&eacute;n es verdad que
para la humanidad la palabra (texto) ha sido un medio muy eficaz de
transmitir informaci&oacute;n durante siglos (al final el
Lat&iacute;n se impuso a la escritura jerogl&iacute;fica
egipcia)</li>
  </ul>
  <li>XML es por naturaleza
extensible, as&iacute; a&ntilde;adir nuevas caracteristicas a
OpenXava es muy f&aacute;cil.</li>
  <li>XML esta muy extendido y
cuenta con gran cantidad de validadores y editores especiales.</li>
  <li>XML es un
est&aacute;ndar conocido.</li>
  <li>XML es muy f&aacute;cil.</li>
</ul>
OpenXava y MDA no son cosas excluyentes, de hecho se puede crear una
herramienta MDA encima de OpenXava; solo habr&iacute;a que generar
los
archivos XML de OpenXava a partir del modelo UML.<br>
<h4><a name="Que_diferencias_hay_entre_xava_y"></a>&iquest;Que
diferencias
hay entre OpenXava y XDoclet?</h4>
XDoclet consigue que lo que antes se hac&iacute;a con varias clases
de
Java y varios complicados archivos XML ahora se puede hacer con una
sola clase de Java. <br>
OpenXava consigue que lo que antes se hac&iacute;a con varias
clases de
Java y varios complicados archivos XML ahora se puede hacer con un solo
y simple archivo XML.<br>
XDoclet y OpenXava son parecidos, solo que en XDoclet la base para
definir
nuestras aplicaciones es el c&oacute;digo Java y en OpenXava es el
XML.<br>
XML parece m&aacute;s natural para definir que Java y sus
anotaciones
porque:<br>
<ul>
  <li>Permite estructuras
jerarquicas.</li>
  <li>Validaci&oacute;n y
autocompletado autom&aacute;tico gracias a
los editores XML.</li>
  <li>M&aacute;s
f&aacute;cil de aprender por un programador no Java.</li>
</ul>
Otra diferencia entre XDoclet y OpenXava es que OpenXava genera no solo
el
c&oacute;digo EJB, sino una aplicaci&oacute;n entera, con la
capa del
controlador y de la interfaz gr&aacute;fica, y ya lista para usar.<br>
XDoclet y OpenXava no son exclusivos, de hecho OpenXava utiliza XDoclet
para
generar el c&oacute;digo EJB, y adem&aacute;s podemos escribir
beans de
EJB con XDoclet e integrarlos en una aplicaci&oacute;n OpenXava si
queremos.<br>
<h4><a name="Por_que_xava_no_usa_Struts"></a>&iquest;Por
qu&eacute; OpenXava no usa Struts?</h4>
Struts permite definir la parte de controlador de una
aplicaci&oacute;n
web, y OpenXava ya tiene su propio marco de controlador. Struts
est&aacute; orientado a la navegaci&oacute;n entre
p&aacute;ginas,
mientras que en las aplicaciones t&iacute;picas de
gesti&oacute;n suele
haber muchos casos en los que permanecemos en una misma
p&aacute;gina
en la que
el usuario puede hacer una cantidad grande de acciones; para esto
Struts es un
poco engorroso, y la capa de controlador de OpenXava acopla mejor.<br>
Otra ventaja es que la capa de controlador de OpenXava no depende de la
tecnolog&iacute;a web, y as&iacute; podr&iacute;amos tener,
por
ejemplo, una aplicaci&oacute;n OpenXava con otra
tecnolog&iacute;a de
presentaci&oacute;n (de hecho existe una versi&oacute;n de
OpenXava para
hacer aplicaciones Swing).<br>
Programadores con experiencia en Struts han mostrado alivio al
trabajar con OpenXava para hacer aplicaciones de gesti&oacute;n.<br>
<h4><a name="Its_only_XML_no_Java_class"></a>&iquest;Es solo XML, no
hay clases&nbsp;Java?</h4>
OpenXava usa JavaBeans para insertar tu propia funcionalidad en la
aplicaci&oacute;n usando el <a href="custom-code.psml">patr&oacute;n
estrategia</a>.<br>
<h4><a name="How_scalable_it_is"></a>&iquest;Cu&aacute;n escalable es
OpenXava?</h4>
OpenXava genera una aplicaci&oacute;n J2EE est&aacute;ndar, por ende es
tan escalable como J2EE.<br>
OpenXava usa Hibernate o EJB CMP2 para persistencia, y algo de estado
con alcance de
sesi&oacute;n a nivel de servlets. El c&oacute;digo generado por
OpenXava es bueno, pero&nbsp;cuando llega el momento de escribir tu
propio c&oacute;digo tienes que ser sabio si quieres obtener un buen
rendimiento, especialmente en los procesos masivos, pero esto un asunto
de J2EE no de OpenXava.<br>
<h4><a name="Con_que_sistema_de_gestion_de_usuarios"></a>&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</h4>
Los modulos generados por OpenXava son portlets JSR-168, por lo tanto
son desplegables en cualquier portal Java compatible con su propias
caracter&iacute;sticas de navegaci&oacute;n y seguridad.<br>
OpenXava viene empaquetado con JetSpeed 2 y usa la seguridad y
navegaci&oacute;n del JetSpeed 2, pero puedes escoger cualquier otro
portal o crear tu propio marco de seguridad y navegaci&oacute;n para
m&oacute;dulos OpenXava.<br>
<h4><a name="Que_servidores_de_aplicaciones_estan"></a>&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</h4>
OpenXava has sido probado con:<br>
<ul>
  <li>Tomcat 5.5</li>
  <li>JBoss 4.0.x y 3.2.x</li>
  <li>WebSphere 6.0, 5.1 y 5.0</li>
</ul>
Cualquier contenedor de Servlets 2.3 puede servir.<br>
Si quieres usar EJB (opcional en v2) necesitaras un servidor de
aplicaciones J2EE 1.3 al menos.<br>
<h4><a name="What_Java_Portals_are_supported"></a>&iquest;Qu&eacute;
portales Java est&aacute;n soportados?</h4>
Cualquier portal compatible con&nbsp;JSR-168. Aunque nosotros lo hemos
usado en producci&oacute;n con:<br>
<ul>
  <li>Apache JetSpeed 2</li>
  <li>WebSphere Portal 5.1</li>
  <li>Liferay</li>
</ul>
<h4><a name="Que_herramientas_de_desarrollo_se"></a>&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</h4>
El archivo de descarga de OpenXava viene con un workspace para Eclipse
3.1
configurado. Pero OpenXava no usa recursos de Eclipse sino que
est&aacute;
basado en la herramienta de c&oacute;digo abierto 'Ant', por lo que
sin
ning&uacute;n problema se puede usar con cualquier otro IDE, e
incluso
desde l&iacute;nea de &oacute;rdenes.<br>
<h4><a name="Con_que_navegadores_de_internet"></a>&iquest;Con
qu&eacute;
navegadores de internet funciona?</h4>
Internet Explorer, Mozilla y Firefox.&nbsp;<br>
<h4><a name="Que_JDK_necesita_para_funcionar"></a>&iquest;Qu&eacute;
JDK necesita para funcionar?</h4>
OpenXava funciona con JDK 1.3.1, JDK 1.4.2 y JDK 5.0<br>
<h4><a name="Podemos_generar_con_xava_una"></a>&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</h4>
No ser&iacute;a dif&iacute;cil de adaptar, porque el nucleo de
OpenXava es
el XML, y no est&aacute; vinculado muy fuertemente a EJB, Hibernate o
Servlets (no como con EJB3 + JSF).
As&iacute; que hacer un generador que hiciera aplicaciones para
PDAs, o
aplicaciones de 2 capas (usando swing por ejemplo) es sencillo. De
hecho la versi&oacute;n inicial de OpenXava funcionaba con Swing +
EJB, la
actual funciona con&nbsp;JSP + Hibernate. Y todo esto sin cambiar las
aplicaciones
OpenXava que siempre tienen la misma estructura.<br>
Con un poco de ingenio se podr&iacute;a hacer incluso una
versi&oacute;n .NET.<br>
<h4><a name="Que_tipo_de_licencia_tiene_openxava"></a>&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</h4>
LGPL. Se puede usar OpenXava para desarrollar proyectos comerciales de
cualquier tipo. Lo &uacute;nico es que no se puede hacer una
versi&oacute;n comercial del propio OpenXava.<br>
