<ul>
  <li><a href="#Why_to_use_OpenXava_if_we_have_Spring">&iquest;Por
qu&eacute; usar OpenXava si tenemos Spring, Hibernate, JSF, EJB3 y
as&iacute; por el estilo?</a></li>
  <li><a href="#Por_que_es_mejor_xava_que_una_solucion">&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</a><br>
  </li>
  <li><a href="#Por_que_xava_no_usa_Struts">&iquest;Por
qu&eacute; OpenXava no usa Struts?</a></li>
  <li><a href="#Its_only_XML_no_Java_class">&iquest;Es
solo XML, no hay
clases Java?</a></li>
  <li><a href="#How_scalable_it_is">&iquest;Cu&aacute;n
escalable es
OpenXava?</a></li>
  <li><a href="#Con_que_sistema_de_gestion_de_usuarios">&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</a><br>
  </li>
  <li><a href="#Que_servidores_de_aplicaciones_estan">&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</a></li>
  <li><a href="#What_Java_Portals_are_supported">&iquest;Qu&eacute;
portales Java est&aacute;n soportados?</a></li>
  <li><a href="#Que_herramientas_de_desarrollo_se">&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</a></li>
  <li><a href="#Que_JDK_necesita_para_funcionar">&iquest;Qu&eacute;
JDK necesita para funcionar?</a></li>
  <li><a href="#Podemos_generar_con_xava_una">&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</a></li>
  <li><a href="#Que_tipo_de_licencia_tiene_openxava">&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</a><br>
  </li>
</ul>
<h4><a name="Why_to_use_OpenXava_if_we_have_Spring"></a>&iquest;Por
qu&eacute; usar OpenXava si tenemos Spring, Hibernate, JSF, EJB3 y
as&iacute; por el estilo?</h4>
Hoy d&iacute;a vivimos buenos tiempos. Es cierto que Spring, Hibernate,
JSF y EJB3 son mucho mejor que J2EE 1.4. Todos esto marcos de trabajo y
tecnolog&iacute;as son buenas (de hecho OpenXava usa algunas de ellas),
pero si necesitas desarrollar
aplicaciones de gesti&oacute;n la cantidad de c&oacute;digo a escribir
sigue siendo grande, y la productividad es baja comparada con otras
tecnolog&iacute;as (Visual Basic, 4GL, Delphi, RPG, etc).<br>
OpenXava simplemente tiene un nivel de abstracci&oacute;n superior para
obtener as&iacute; una forma simple y f&aacute;cil de desarrollar
aplicaciones de gesti&oacute;n con J2EE y con estilo Orientado a
Objetos.<br>
Si no me crees. Pruebalo. Mira las aplicaciones de demo, por
ejemplo&nbsp;<span style="font-style: italic;">JBoss Seam Booking Demo</span>
desarrollada con OpenXava, mira su c&oacute;digo e intenta
desarrollarla con tu marco de trabajo favorito, y comparalo por ti
mismo.<br>
<h4><a name="Por_que_es_mejor_xava_que_una_solucion"></a>&iquest;Por
qu&eacute; es mejor OpenXava que una soluci&oacute;n MDA?</h4>
Yo no dir&iacute;a que es mejor, simplemente es diferente. Con MDA
generamos una aplicaci&oacute;n a partir de unos modelos UML y
as&iacute; reducimos los costes de desarrollo. Con OpenXava hacemos
lo
mismo, pero en lugar de hacer la definici&oacute;n con UML la
hacemos con XML.<br>
Y as&iacute; tenemos un conjunto de suculentas ventajas respecto a
MDA:<br>
<ul>
  <li>XML es texto, por lo tanto:</li>
  <ul>
    <li>No necesitamos
herramientas sofisticadas, un simple editor sirve.<br>
    </li>
    <li>Mucha gente prefiere el
texto a los gr&aacute;ficos. Porque es verdad 'que una imagen vale
m&aacute;s que mil palabras', pero tambi&eacute;n es verdad que
para la humanidad la palabra (texto) ha sido un medio muy eficaz de
transmitir informaci&oacute;n durante siglos (al final el
Lat&iacute;n se impuso a la escritura jerogl&iacute;fica
egipcia)</li>
  </ul>
  <li>XML es por naturaleza
extensible, as&iacute; a&ntilde;adir nuevas caracteristicas a
OpenXava es muy f&aacute;cil.</li>
  <li>XML esta muy extendido y
cuenta con gran cantidad de validadores y editores especiales.</li>
  <li>XML es un
est&aacute;ndar conocido.</li>
  <li>XML es muy f&aacute;cil.</li>
</ul>
OpenXava y MDA no son cosas excluyentes, de hecho se puede crear una
herramienta MDA encima de OpenXava; solo habr&iacute;a que generar
los
archivos XML de OpenXava a partir del modelo UML.
<h4><a name="Por_que_xava_no_usa_Struts"></a>&iquest;Por
qu&eacute; OpenXava no usa Struts?</h4>
Struts permite definir la parte de controlador de una
aplicaci&oacute;n
web, y OpenXava ya tiene su propio marco de controlador. Struts
est&aacute; orientado a la navegaci&oacute;n entre
p&aacute;ginas,
mientras que en las aplicaciones t&iacute;picas de
gesti&oacute;n suele
haber muchos casos en los que permanecemos en una misma
p&aacute;gina
en la que
el usuario puede hacer una cantidad grande de acciones; para esto
Struts es un
poco engorroso, y la capa de controlador de OpenXava acopla mejor.<br>
Otra ventaja es que la capa de controlador de OpenXava no depende de la
tecnolog&iacute;a web, y as&iacute; podr&iacute;amos tener,
por
ejemplo, una aplicaci&oacute;n OpenXava con otra
tecnolog&iacute;a de
presentaci&oacute;n (de hecho existe una versi&oacute;n de
OpenXava para
hacer aplicaciones Swing).<br>
Programadores con experiencia en Struts han mostrado alivio al
trabajar con OpenXava para hacer aplicaciones de gesti&oacute;n.<br>
<h4><a name="Its_only_XML_no_Java_class"></a>&iquest;Es solo XML, no
hay clases&nbsp;Java?</h4>
OpenXava usa JavaBeans para insertar tu propia funcionalidad en la
aplicaci&oacute;n usando el <a href="custom-code.psml">patr&oacute;n
estrategia</a>.<br>
Adem&aacute;s la pr&oacute;xima versi&oacute;n de OpenXava (3.0)
permitir&aacute; usar clases Java + anotaciones como alternativa al XML
para definir componentes de negocio.<br>
<h4><a name="How_scalable_it_is"></a>&iquest;Cu&aacute;n escalable es
OpenXava?</h4>
OpenXava genera una aplicaci&oacute;n Java EE/J2EE est&aacute;ndar, por
ende es
tan escalable como Java EE/J2EE.<br>
OpenXava usa EJB3 JPA, Hibernate o EJB CMP2 para persistencia, y algo
de estado
con alcance de
sesi&oacute;n a nivel de servlets. El c&oacute;digo generado por
OpenXava es bueno, pero&nbsp;cuando llega el momento de escribir tu
propio c&oacute;digo tienes que ser sabio si quieres obtener un buen
rendimiento, especialmente en los procesos masivos, pero esto un asunto
de J2EE no de OpenXava.<br>
<h4><a name="Con_que_sistema_de_gestion_de_usuarios"></a>&iquest;Con
qu&eacute; sistema de gesti&oacute;n de usuarios y
navegaci&oacute;n cuenta OpenXava?</h4>
Los modulos generados por OpenXava son portlets JSR-168, por lo tanto
son desplegables en cualquier portal Java compatible con su propias
caracter&iacute;sticas de navegaci&oacute;n y seguridad.<br>
El sitio de OpenXava usa Liferay Portal , por lo tanto en este caso se
usa la seguridad de Liferay, pero se puede escoger cualquier otro
portal o crear nuestro propio sistema de seguridad y navegaci&oacute;n
para los m&oacute;dulos OpenXava.<br>
<h4><a name="Que_servidores_de_aplicaciones_estan"></a>&iquest;Qu&eacute;
servidores de aplicaciones est&aacute;n soportados?</h4>
OpenXava has sido probado con:<br>
<ul>
  <li>Tomcat 5.5</li>
  <li>JBoss 4.0.x y 3.2.x</li>
  <li>WebSphere 6.1, 6.0, 5.1 y 5.0</li>
</ul>
Cualquier contenedor de Servlets 2.3 puede servir.<br>
Si quieres usar EJB (opcional en v2 o superior) necesitar&aacute;s un
servidor de
aplicaciones J2EE 1.3 al menos.<br>
Si quieres usar&nbsp;EJB3 JPA necesitar&aacute;s un servidor de
aplicaciones con soporte para Java 5 (un servidor Java EE 5 no es
necesario).<br>
WebSphere 5.0 funciona bien con&nbsp;OpenXava 1.2.1, pero no se testea
desde&nbsp;OpenXava 2.
<h4><a name="What_Java_Portals_are_supported"></a>&iquest;Qu&eacute;
portales Java est&aacute;n soportados?</h4>
Cualquier portal compatible con&nbsp;JSR-168. Aunque lo siguientes
est&aacute;n probados:<br>
<ul>
  <li>Apache JetSpeed 2</li>
  <li>WebSphere Portal 5.1 and 6.0</li>
  <li>Liferay 4.1.x</li>
</ul>
<h4><a name="Que_herramientas_de_desarrollo_se"></a>&iquest;Qu&eacute;
herramientas de desarrollo se pueden usar?</h4>
El archivo de descarga de OpenXava viene con un workspace para Eclipse
configurado. Pero OpenXava no usa recursos de Eclipse sino que
est&aacute;
basado en la herramienta de c&oacute;digo abierto 'Ant', por lo que
sin
ning&uacute;n problema se puede usar con cualquier otro IDE, e
incluso
desde l&iacute;nea de &oacute;rdenes.<br>
<h4><a name="Que_JDK_necesita_para_funcionar"></a>&iquest;Qu&eacute;
JDK necesita para funcionar?</h4>
OpenXava funciona con JDK 1.4.2, JDK 5.0 y JDK 6.0.<br>
Si quieres usar EJB3 JPA necesitar&aacute;s al menos un Java 5.<br>
JDK 1.3.1 funciona bien con OpenXava 1.2.1, pero no est&aacute;
testeado desde OpenXava 2.
<h4><a name="Podemos_generar_con_xava_una"></a>&iquest;Podemos
generar
con OpenXava una aplicaci&oacute;n que no sea J2EE?</h4>
No ser&iacute;a dif&iacute;cil de adaptar, porque el nucleo de
OpenXava es
el XML (tambi&eacute;n POJOs en v3), y no est&aacute; vinculado muy
fuertemente a EJB, Hibernate o
Servlets (no como con EJB3 + JSF).
As&iacute; que hacer un generador que hiciera aplicaciones para
PDAs, o
aplicaciones de 2 capas (usando swing por ejemplo) es sencillo. De
hecho la versi&oacute;n inicial de OpenXava funcionaba con Swing +
EJB, la
actual funciona con&nbsp;JSP + Hibernate. Y todo esto sin cambiar las
aplicaciones
OpenXava que siempre tienen la misma estructura.<br>
Con un poco de ingenio se podr&iacute;a hacer incluso una
versi&oacute;n .NET, PHP o Ruby.<br>
<h4><a name="Que_tipo_de_licencia_tiene_openxava"></a>&iquest;Qu&eacute;
tipo de licencia tiene OpenXava?</h4>
LGPL. Se puede usar OpenXava para desarrollar proyectos comerciales de
cualquier tipo. Lo &uacute;nico es que no se puede hacer una
versi&oacute;n comercial del propio OpenXava.<br>
